In [103]:
# importando a minha biblíoteca pandas 
import pandas as pd

# PARTE DE EXPLORAÇÃO DOS DADOS

In [ ]:
#  Lendo o meu conjunto de dados e vendo as 5 primeiras linhas dele
df = pd.read_csv("data_sales (1).csv", sep= ",")
df.head(5)

,Retailer,Retailer ID,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Sales Method
0,Walmart,1128299,6/17/2021,Southeast,Florida,Orlando,Women's Apparel,$103.00,218,"2,245","$1,257",Online
1,West Gear,1128299,7/16/2021,South,Louisiana,New Orleans,Women's Apparel,$103.00,163,"1,679",$806,Online
2,Sports Direct,1197831,8/25/2021,South,Alabama,Birmingham,Men's Street Footwear,$10.00,700,"7,000","$3,150",Outlet
3,Sports Direct,1197831,8/27/2021,South,Alabama,Birmingham,Women's Street Footwear,$15.00,575,"8,625","$3,881",Outlet
4,Sports Direct,1197831,8/21/2021,South,Alabama,Birmingham,Women's Street Footwear,$15.00,475,"7,125","$3,206",Outlet

In [105]:
# vendo quantas linhas e colunas tem o meu conjunto de dados.
df.shape

(9641, 12)

In [106]:
# vendo os tipos do meu dados e quantos registro tem para ver se existe algum dados faltante 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9641 entries, 0 to 9640
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9641 non-null   object
 1   Retailer ID       9641 non-null   int64
 2   Invoice Date      9641 non-null   object
 3   Region            9641 non-null   object
 4   State             9641 non-null   object
 5   City              9641 non-null   object
 6   Product           9641 non-null   object
 7   Price per Unit    9639 non-null   object
 8   Units Sold        9641 non-null   object
 9   Total Sales       9641 non-null   object
 10  Operating Profit  9641 non-null   object
 11  Sales Method      9641 non-null   object
dtypes: int64(1), object(11)
memory usage: 904.0+ KB

In [107]:
# verificando qual os dados estão nulos 
df[df["Price per Unit"].isnull()]

,Retailer,Retailer ID,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Sales Method
6725,Foot Locker,1185732,1/29/2020,Northeast,New York,New York,Men's Apparel,NaN,850,"51,000","$15,300",Outlet
7882,Sports Direct,1197831,7/29/2020,South,Texas,Houston,Men's Apparel,NaN,500,"20,000","$6,000",Outlet

In [108]:
# verificando se existe alguma duplicada no meu conjunto de dados  
df.duplicated().sum()

np.int64(0)

In [109]:
# somando quantos números faltante existe 
df.isnull().sum()

Retailer            0
Retailer ID         0
Invoice Date        0
Region              0
State               0
City                0
Product             0
Price per Unit      2
Units Sold          0
Total Sales         0
Operating Profit    0
Sales Method        0
dtype: int64

#  TRANSFORMAÇÃO DOS MEUS DADOS

In [110]:
df.columns

Index(['Retailer', 'Retailer ID', 'Invoice Date', 'Region', 'State', 'City',
       'Product', 'Price per Unit', 'Units Sold', 'Total Sales',
       'Operating Profit', 'Sales Method'],
      dtype='object')

In [111]:
converter_float = ["Total Sales", "Price per Unit", "Operating Profit"]
converter_int = ["Retailer ID", "Units Sold"]
converter_data = ["Invoice Date"]

# Limpar $ e , em todas as colunas float
for col in converter_float:
    df[col] = df[col].str.replace("$", "", regex=False).str.replace(",", "", regex=False)

# Converter para float
df[converter_float] = df[converter_float].apply(pd.to_numeric, errors="coerce")

# Converter int
df[converter_int] = df[converter_int].apply(pd.to_numeric, errors="coerce")

# Converter data
df[converter_data] = df[converter_data].apply(pd.to_datetime, errors='coerce')

In [112]:
df.info()
df.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9641 entries, 0 to 9640
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9641 non-null   object
 1   Retailer ID       9641 non-null   int64
 2   Invoice Date      9641 non-null   datetime64[ns]
 3   Region            9641 non-null   object
 4   State             9641 non-null   object
 5   City              9641 non-null   object
 6   Product           9641 non-null   object
 7   Price per Unit    9639 non-null   float64
 8   Units Sold        9588 non-null   float64
 9   Total Sales       9641 non-null   int64
 10  Operating Profit  9641 non-null   int64
 11  Sales Method      9641 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(3), object(6)
memory usage: 904.0+ KB

,Retailer,Retailer ID,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Sales Method
0,Walmart,1128299,2021-06-17,Southeast,Florida,Orlando,Women's Apparel,103.0,218.0,2245,1257,Online
1,West Gear,1128299,2021-07-16,South,Louisiana,New Orleans,Women's Apparel,103.0,163.0,1679,806,Online
2,Sports Direct,1197831,2021-08-25,South,Alabama,Birmingham,Men's Street Footwear,10.0,700.0,7000,3150,Outlet
3,Sports Direct,1197831,2021-08-27,South,Alabama,Birmingham,Women's Street Footwear,15.0,575.0,8625,3881,Outlet
4,Sports Direct,1197831,2021-08-21,South,Alabama,Birmingham,Women's Street Footwear,15.0,475.0,7125,3206,Outlet

In [113]:
# vendo os registros nulos 
df[df["Units Sold"].isnull()]

# completando os dados faltando com a média 
df["Units Sold"] = df["Units Sold"].fillna(df["Units Sold"].mean())

# completando os dados faltando com a média 
df["Price per Unit"] = df["Price per Unit"].fillna(df["Price per Unit"].mean())

In [114]:
# visualizando os meus dados para ver se converteu todos 
df.info()

# verificando se ficou algum número faltando 
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9641 entries, 0 to 9640
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9641 non-null   object
 1   Retailer ID       9641 non-null   int64
 2   Invoice Date      9641 non-null   datetime64[ns]
 3   Region            9641 non-null   object
 4   State             9641 non-null   object
 5   City              9641 non-null   object
 6   Product           9641 non-null   object
 7   Price per Unit    9641 non-null   float64
 8   Units Sold        9641 non-null   float64
 9   Total Sales       9641 non-null   int64
 10  Operating Profit  9641 non-null   int64
 11  Sales Method      9641 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(3), object(6)
memory usage: 904.0+ KB

Retailer            0
Retailer ID         0
Invoice Date        0
Region              0
State               0
City                0
Product             0
Price per Unit      0
Units Sold          0
Total Sales         0
Operating Profit    0
Sales Method        0
dtype: int64

In [ ]:
# salvando em arquivo csv
df.to_csv("Dados_Limpo_adidas.csv", index=False, encoding="utf-8")